//ЗАДАЧА 1 розділити масив на вказане число____________________________________________________
// function eachCons(arr, n) {
//     //
// }
// console.log(eachCons([1, 2, 3, 4, 5, 6], 2));
// console.log(eachCons([1, 2, 3, 4, 5, 6], 3));

//ЗАДАЧА 2 відібрати унікальні значення (ті що не повторюються)__________________________________________________________

// const fruits = ['kiwi', 'apple', 'orange', 'kiwi', 'apple'];

//ЗАДАЧА 3 скільки разів елемент зустрічається в масиві {kiwi:3, apple:2, orange:1}_______________________________________________________
// const myFruits = ['kiwi', 'apple', 'orange', 'kiwi', 'apple', 'kiwi'];
//ЗАДАЧА 4 записати строку в зворотньому порядку (pizza = azzip)________________________________________________
//ЗАДАЧА 5
//ЗАДАЧА 6
//ЗАДАЧА 7
//ЗАДАЧА 8
//ЗАДАЧА 9
//ЗАДАЧА 10
